# VertexPosition Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPosition Constructor
VertexPosition Class See Also
---
Constructs the vertex from a point.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public VertexPosition(
	XYZ position
)
```

Visual Basic
---
```text
Public Sub New ( _
	position As XYZ _
)
```

Visual C++
---
```text
public:
VertexPosition(
	XYZ^ position
)
```

# ### Parameters
position
    Type: Autodesk.Revit.DB..::..XYZ The vertex's position.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace